# -*-coding: UTF-8 -*-

label2 = """N
A30,30,0,900,1,1,N,"产品名称: 组合式电气火灾监控探测器    型号: HS-I 620"
A30,50,0,900,1,1,N,"执行标准: GB14287.2-2014   :   GB14287.3-2014"
A30,70,0,900,1,1,N,"主要技术参数:额定供电电压:AC220V 50HZ  温度报警设定值:45~140℃ 步长1℃"
A30,90,0,900,1,1,N,"剩余电流报警设定值： 100-1000mA 步长mA"
A30,110,0,900,1,1,N,"地址： 上海市浦东新区康桥镇浦三路3677弄8支弄1-3号1幢2层C座， D座"
A30,130,0,900,1,1,N,"生产日期: " "TD"
A30,150,0,900,1,1,N,"生产编号："
B90,150,0,3,3,7,50,B,"16002A7381554"
P1
"""

label1 = """N
A30,10,0,902,1,1,N,"产品名称: 组合式电气火灾监控探测器      型号: HS-I 620" 
A30,25,0,902,1,1,N,"执行标准: GB14287.2-2014   :   GB14287.3-2014"
A30,40,0,902,1,1,N,"主要技术参数: 额定供电电压:AC220V 50HZ  温度报警设定值:45~140℃ 步长1℃"
A120,55,0,902,1,1,N,"剩余电流报警设定值： 100-1000mA 步长mA"
A30,70,0,902,1,1,N,"地址： 上海市浦东新区康桥镇浦三路3677弄8支弄1-3号1幢2层C座D座"
A30,90,0,902,1,1,N,"生产编号："
B90,90,0,1E,1,1,30,N,B,"serialmsg"
A320,100,0,902,1,1,N,"制造日期:" "TDATE" 
A120,120,0,902,1,1,N,"serialmsg"
A320,115,0,902,1,1,N,"上海华宿电气股份有限公司　Z3"
P1
"""

label11 = """N
A30,30,0,900,1,1,N,"产品名称: 组合式电气火灾监控探测器  型号: HS-I 620"
A30,50,0,900,1,1,N,"执行标准: GB14287.2-2014   :   GB14287.3-2014"
A30,70,0,900,1,1,N,"主要技术参数:额定供电电压:AC220V 50HZ  温度报警设定值:45~140℃ 步长1℃"
A30,90,0,900,1,1,N,"剩余电流报警设定值： 100-1000mA 步长mA"
A30,110,0,900,1,1,N,"地址： 上海市浦东新区康桥镇浦三路3677弄8支弄1-3号1幢2层C座， D座"
A30,130,0,900,1,1,N,"生产日期: " "TDATE"
A30,150,0,900,1,1,N,"生产编号："
B90,150,0,3,3,7,50,B,"serialmsg"
P1
"""