# -*-coding: UTF-8 -*-
import serial
import time
from label1 import label1
cur_date = time.strftime("%Y/%m/%d")


msg2 = """N
A30,30,0,900,1,1,N,"产品名称: 组合式电气火灾监控探测器    型号: HS-I 620"
A30,50,0,900,1,1,N,"执行标准: GB14287.2-2014   :   GB14287.3-2014"
A30,70,0,900,1,1,N,"主要技术参数: 额定供电电压： AC220V 50HZ  温度表镜设定值： 45~140℃ 步长1℃"
A30,90,0,900,1,1,N,"剩余电流报警设定值： 100-1000mA 步长mA"
A30,110,0,900,1,1,N,"地址： 上海市浦东新区康桥镇浦三路3677弄8支弄1-3号1幢2层C座， D座"
A30,130,0,900,1,1,N,"生产日期: " "TD"
A30,150,0,900,1,1,N,"生产编号："
B90,150,0,3,3,7,50,B,"16002A7381554"

P1
""".replace("TD",cur_date)



msg1 = """N
A30,30,0,901,1,1,N,"产品名称: 组合式电气火灾监控探测器    型号: HS-I 620"
A30,50,0,901,1,1,N,"执行标准: GB14287.2-2014 : GB14287.3-2014"
A30,70,0,901,1,1,N,"主要技术参数: 额定供电电压:AC220V 50HZ 温度报警设定值:45~140℃ 步长1℃"
A30,90,0,901,1,1,N,"剩余电流报警设定值:100-1000mA 步长mA"
A30,110,0,901,1,1,N,"地址: 上海市浦东新区康桥镇浦三路3677弄8支弄1-3号1幢2层C座D座"
A30,130,0,901,1,1,N,"生产日期: " "TD"
A30,150,0,901,1,1,N,"生产编号："
B130,150,0,3,3,7,50,B,"16002A7381554"

P1
""".replace("TD",cur_date)
msg = label2.replace("TD",cur_date)
ser = serial.Serial('COM3')
print(ser)

sendmsg = msg.encode("GB2312")
print(sendmsg)
ser.write(sendmsg)
ser.close()